hiro22022/ASP3_STM32H747_DISCO/target/stm32h747_discovery_m7/stm32hcube/CM7/Core/Src/main.c
static char
usart_getchar_block()
{
  while( usart_getready() == 0 ) {}
 	return usart_getchar();
}

static void
usart_puts( char *s)
{
  while(*s){
    while(!usart_putready()) ;
    usart_putchar(*s++);
  }
}

/*---------------------------------------------*/
#define SIO_BUF_LEN   256
char  sio_send_buf[ SIO_BUF_LEN ];
volatile  int  sio_send_buf_wp;
volatile  int  sio_send_buf_rp;

char  sio_receive_buf[ SIO_BUF_LEN ];
volatile  int  sio_receive_buf_wp;
volatile  int  sio_receive_buf_rp;
volatile  int  sio_receive_discard;

static void
SIO_putchar( int c )
{
  int  next_wp;
#if 0
  bool_t  int_disabled = __get_PRIMASK() & 0x1 ;

  if( ! int_disabled )
    __disable_irq();

  led_set( 4 );
  // 割込みを禁止した瞬間に、送信完了割込みが入るケースを想定
  if( sio_send_buf_wp == sio_send_buf_rp    // 未送信のデータがバッファにない
    && usart_putready() ){                  // 送信可能
    led_set( 5 );
    usart_putchar(c);
  }
  else {
    // ここへ来るまでに、送信完了割込みが入らないように割込みを禁止している
#endif
    sio_send_buf[sio_send_buf_wp] = (char)c;
    next_wp = sio_send_buf_wp + 1;
    if( next_wp >= SIO_BUF_LEN )
      next_wp  = 0;
    // 空きができるまで待つ
    while( next_wp == sio_send_buf_rp )
    { }
    sio_send_buf_wp = next_wp;
#if 0
  }
#endif

  usart_ena_txint();      // 最初の一文字(空になっている)場合、すぐに割込みが入る
#if 0
  if( ! int_disabled )
    __enable_irq();
#endif // 0
}

static void
SIO_puts( char *s)
{
#if 0
  usart_puts( s );
#else
    while( *s ){
      SIO_putchar( *s++ );
    }
#endif //1 
}

static char
SIO_getchar(void)
{
  char c;
  int  next_rp;
  while( sio_receive_buf_wp == sio_receive_buf_rp ){}
  c = sio_receive_buf[ sio_receive_buf_rp ];
  next_rp = sio_receive_buf_rp + 1;
  if( next_rp >= SIO_BUF_LEN )
    next_rp = 0;
  sio_receive_buf_rp = next_rp;

  return c;
}

static void
SIO_flush(void)
{
  /* すべての送信が終わるのを待つ */
  while( sio_send_buf_rp != sio_send_buf_wp ) {}
}


static void
ciSIOCBR_readyReceive()
{
  char c;
  int next_wp;
  /* 受信データがあるか? */
  if( usart_getready() == 0 )
    return;
  c = usart_getchar();
  sio_receive_buf[ sio_receive_buf_wp ] = c;
  next_wp = sio_receive_buf_wp + 1;
  if( next_wp >= SIO_BUF_LEN )
    next_wp = 0;
  if( next_wp != sio_receive_buf_rp )
    sio_receive_buf_wp = next_wp;
  else
    sio_receive_discard = 1;
}

static void
ciSIOCBR_readySend()
{
  int  next_rp;

  if( sio_send_buf_rp == sio_send_buf_wp ){
    /* これ以上送るものがないので、割込みを禁止して終了する */
    usart_dis_txint();
  }
  else{
    usart_putchar( sio_send_buf[sio_send_buf_rp] );
    next_rp = sio_send_buf_rp + 1;
    if( next_rp >= SIO_BUF_LEN )
      next_rp = 0;
    sio_send_buf_rp = next_rp;
  }
}

/*---------------------------------------------*/



/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM5_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
/* USER CODE BEGIN Boot_Mode_Sequence_0 */
  int32_t timeout;
/* USER CODE END Boot_Mode_Sequence_0 */

/* USER CODE BEGIN Boot_Mode_Sequence_1 */
  /* Wait until CPU2 boots and enters in stop mode or timeout*/
  timeout = 0xFFFF;
  while((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) != RESET) && (timeout-- > 0));
  if ( timeout < 0 )
  {
    Error_Handler();
  }

#if 1
  // Time wait  to make a chance to halt CPU when programming by STM32CubeProgrammer
  volatile int k;
  for( k = 0; k < 5 * 1000 * 1000; k++ ){}
#endif

/* USER CODE END Boot_Mode_Sequence_1 */
  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();
/* USER CODE BEGIN Boot_Mode_Sequence_2 */
  /* When system initialization is finished, Cortex-M7 will release Cortex-M4 by means of
  HSEM notification */
  /*HW semaphore Clock enable*/
  __HAL_RCC_HSEM_CLK_ENABLE();
  /*Take HSEM */
  HAL_HSEM_FastTake(HSEM_ID_0);
  /*Release HSEM in order to notify the CPU2(CM4)*/
  HAL_HSEM_Release(HSEM_ID_0,0);
  /* wait until CPU2 wakes up from stop mode */
  timeout = 0xFFFF;
  while((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) == RESET) && (timeout-- > 0));
  if ( timeout < 0 )
  {
    Error_Handler();
  }
/* USER CODE END Boot_Mode_Sequence_2 */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();
  MX_TIM5_Init();
  /* USER CODE BEGIN 2 */
#define MSG_CM7 "hello CM7!\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_CM7, sizeof(MSG_CM7), 0xfffffff);

  //-------------------------
  // print clock frequency calculated from register settings
  uint32_t   clk_val;
  char  buf[32];
  clk_val = HAL_RCC_GetSysClockFreq();
  snprintf( buf, sizeof(buf), "SysClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCC_GetHCLKFreq();
  snprintf( buf, sizeof(buf), "HClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCC_GetPCLK1Freq();
  snprintf( buf, sizeof(buf), "P1ClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCC_GetPCLK2Freq();
  snprintf( buf, sizeof(buf), "P2ClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCCEx_GetD1SysClockFreq();
  snprintf( buf, sizeof(buf), "D1SysCloc=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCCEx_GetD1PCLK1Freq();
  snprintf( buf, sizeof(buf), "D1PCLK1=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCCEx_GetD3PCLK1Freq();
  snprintf( buf, sizeof(buf), "D3PCLK1=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  //-------------------------

  led_init();
  int  i, j = 0;
  for( j = 0; j < 16; j++ ){
    for( i = 0; i < 100 * 1000; i++ ){
      /* 単純なループだと消される可能性があるので、値が変わらなくても毎回呼出す */
      /* 時間を延ばす役割もある */
      led_set( j );
    }
  }

