hiro22022/ASP3_STM32H747_DISCO/target/stm32h747_discovery_m7/stm32hcube/CM7/Core/Src/main.c
#define TIMX_CLOCK_HZ (40 * 1000 * 1000 * 2)   // APB1 クロック(40MHz) の 2倍
        // APB1CLKDivider を分周した場合は、2倍or4倍になるが、分周しない(DIV1)場合はAPB1と同じクロック

/**
  * @brief TIM2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM2_Init(void)
{

  /* USER CODE BEGIN TIM2_Init 0 */

  /* USER CODE END TIM2_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM2_Init 1 */
#if 0
	__HAL_RCC_TIM2_CLK_ENABLE();
#endif

  /* USER CODE END TIM2_Init 1 */
  htim2.Instance = TIM2;
#if 0
  htim2.Init.Prescaler = 0;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 4294967295;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
#else
	htim2.Init.Period = 0xFFFFFFFF;
//	htim2.Init.Period = 0xffff;                            // 65,535 μsec
	htim2.Init.Prescaler = (TIMX_CLOCK_HZ/1000000);    /* 1μsec / count */
	htim2.Init.ClockDivision = 0;
	htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;  /* STM32H747 added */
#endif
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    Error_Handler();
  }

#if 1
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
#else
  (void)sClockSourceConfig;
  (void)sMasterConfig;
#endif

#if 1
  /* USER CODE BEGIN TIM2_Init 2 */
  /* カウンターをスタート */
  if(HAL_TIM_Base_Start(&htim2) != HAL_OK) {
    /* Initialization Error */
#define MSG_BASE_START_ERR "HAL_TIM_Base_Start Error\r\n"
    HAL_UART_Transmit(&huart1, (uint8_t*)MSG_BASE_START_ERR, sizeof(MSG_BASE_START_ERR), 0xfffffff);
    Error_Handler();
  }
#define MSG_HAL_TIM2_INIT_DONE "HAL_TIM_Base_Start TIM2 Done\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_HAL_TIM2_INIT_DONE, sizeof(MSG_HAL_TIM2_INIT_DONE), 0xfffffff);
#endif
  /* USER CODE END TIM2_Init 2 */

}

/**
  * @brief TIM5 Initialization Function
  * @param None
  * @retval None
  */
#ifdef  UNUSED_TIM
static void MX_TIM5_Init(void)
{

  /* USER CODE BEGIN TIM5_Init 0 */

  /* USER CODE END TIM5_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM5_Init 1 */

  /* USER CODE END TIM5_Init 1 */
  htim_clk.Instance = TIM5;
  htim_clk.Init.Prescaler = 0;
  htim_clk.Init.CounterMode = TIM_COUNTERMODE_UP;
#if 0
  htim_clk.Init.Period = 4294967295;
#else
  htim_clk.Init.Period = 100 * 1000;
#endif
  htim_clk.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim_clk.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim_clk) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim_clk, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_OnePulse_Init(&htim_clk, TIM_OPMODE_SINGLE) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim_clk, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM5_Init 2 */

  /* USER CODE END TIM5_Init 2 */

}

#else // UNUSED_TIM
static void MX_TIM5_Init(void)
{

  /* USER CODE BEGIN TIM5_Init 0 */

  /* USER CODE END TIM5_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM5_Init 1 */
#if 0
	__HAL_RCC_TIM5_CLK_ENABLE();
#endif

  /* USER CODE END TIM5_Init 1 */
  htim_clk.Instance = TIM_CLK;
#ifndef OnePulseF401
#if 0
  htim_clk.Init.Prescaler = 0;
  htim_clk.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim_clk.Init.Period = 4294967295;
  htim_clk.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim_clk.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
#else
	htim_clk.Init.Period = 1000;                          // 1,000 μsec
	htim_clk.Init.Prescaler = (TIMX_CLOCK_HZ/1000000);     // 1μsec/count
	htim_clk.Init.ClockDivision = 0;
	htim_clk.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim_clk.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;  /* STM32H747 added */
#endif

  if (HAL_TIM_Base_Init(&htim_clk) != HAL_OK)
  {
    Error_Handler();
  }

#else // OnePulseF401
	/* Enable Clock. Use APB1 timer clock */
	__HAL_RCC_TIM5_CLK_ENABLE();

	htim_clk.Init.Period = 0xFF;
	htim_clk.Init.Prescaler = (TIMX_CLOCK_HZ/1000000);
	htim_clk.Init.ClockDivision = 0;
	htim_clk.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim_clk.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;  /* STM32H747 added */

	/* One-pulse Mode */
	if(HAL_TIM_OnePulse_Init(&htim_clk,TIM_OPMODE_SINGLE) != HAL_OK) {
		/* Initialization Error */
		Error_Handler();
	}
	/* clear interrupt */
	__HAL_TIM_CLEAR_FLAG(&htim_clk, TIM_SR_UIF);
	/* enable interrupt */
	__HAL_TIM_ENABLE_IT(&htim_clk, TIM_IT_UPDATE);

#define HALTIMOnePulseInitMSG "HAL_TIM_OnePulse_Init done\r\n"
    HAL_UART_Transmit(&huart1, (uint8_t*)HALTIMOnePulseInitMSG, sizeof(HALTIMOnePulseInitMSG), 0xfffffff);

#endif  //OnePulseF401

#if 1
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim_clk, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim_clk, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
#else
  (void)sClockSourceConfig;
  (void)sMasterConfig;
#endif
}

void TIM_CLK_IRQHandler()
{
  void target_hrt_handler(void);    /* target_timer.c */
  tim_clk_count++;
#if 0
  if( tim_clk_count % COUNT_BASE == 0 )
    led_set( tim_clk_count / COUNT_BASE );
#elif 0
#define COUNT_BASE2 (10 *1000)
  if( tim_clk_count % COUNT_BASE2 == 0 )
    led_set( tim_clk_count / COUNT_BASE2 );
#endif

