hiro22022/ASP3_STM32H747_DISCO/target/stm32h747_discovery_m7/stm32hcube/CM7/Core/Src/main.c
#ifndef OnePulseF401
  // 動的にタイマ値を変更するテスト
  // タイマ値 0 にセットした時、2度と割込みが入らない(一周するのかもしれない。 未確認)
#if 0
  __HAL_TIM_SET_AUTORELOAD(&htim_clk, (tim_clk_count%1000)+1);
#elif 0
  // カウント1 が期待したように動作するかのテスト
  __HAL_TIM_SET_AUTORELOAD(&htim_clk, (tim_clk_count%2)==0?1:1000);
#elif 0
  __HAL_TIM_SET_AUTORELOAD(&htim_clk, 1000);
#endif
  if( ! b_sta_ker ){
    __HAL_TIM_SET_AUTORELOAD(&htim_clk, 1000);
    __disable_irq();  // ここへ来たということは割込み許可されている。
                      // 以下の2つの間で割込みが入ると 1μ秒以下で終わることが保証できない。
                      // タイマー時間が十分長い場合は、不要だが、ここでは最短 1μ秒となることを仮定する。
    __HAL_TIM_SET_COUNTER(&htim_clk, 0);          // カウンタを 0にする
    __HAL_TIM_CLEAR_FLAG(&htim_clk, TIM_SR_UIF);  // 割込みフラグをクリア
    __enable_irq();
  }
  else {
    target_hrt_handler();
  }

#else // OnePulseF401
  if( tim_clk_count % 1000  == 0 ){
    #define TIM_CLK_IRQHandlerMSG "TIM_CLK_IRQHandler OnePulse\r\n"
    HAL_UART_Transmit(&huart1, (uint8_t*)TIM_CLK_IRQHandlerMSG, sizeof(TIM_CLK_IRQHandlerMSG), 0xfffffff);
  }

	/* Clear Event */
	__HAL_TIM_CLEAR_FLAG(&Tim5Handle, TIM_SR_UIF);

  int hrtcnt = 1000;

	__HAL_TIM_SET_COUNTER(&Tim5Handle, 0);
	__HAL_TIM_SET_AUTORELOAD(&Tim5Handle, hrtcnt);
	HAL_TIM_Base_Start(&Tim5Handle);

#endif // OnePulseF401
}
#endif // UNUSED_TIM

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart1.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  huart1.FifoMode = UART_FIFOMODE_ENABLE;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetTxFifoThreshold(&huart1, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetRxFifoThreshold(&huart1, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_DisableFifoMode(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/* USART1 Handler */
void USART1_IRQHandler()
{
  void   _kernel_inthdr_53(void);

  if( !b_sta_ker ){
  // HAL_UART_IRQHandler(&huart1);
    usart_ISRHandler();
  }
  else{
    _kernel_inthdr_53();
  }

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();

  /*Configure GPIO pin : CEC_CK_MCO1_Pin */
  GPIO_InitStruct.Pin = CEC_CK_MCO1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
  HAL_GPIO_Init(CEC_CK_MCO1_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
    led_blink( 8, 9 );
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
